* File list
#+tblname: file_list
| id                   | filename            | status |                           |
|----------------------+---------------------+--------+---------------------------|
| driver               | arduino.org         | S      |                           |
| python_functions     | arduino.py          | STA    |                           |
| lisp_functions       | arduino.lisp        | T0     | inside string ends with ; |
| function_enums       | functions_enums.c   | T      | ends with,                |
| function_definitions | functions.c         | T      | function definitions      |
| function_names       | function_names.c    | T      | ends with a coma          |
| function_PROGMEM     | functions_PROGMEM.c | T      |                           |
| function_doc         | function_doc.c      | T      |                           |
| template             | ulisp.tmpl          | I      |                           |
| output               | ulisp.ino           | O      |                           |
| headers              | ulisp/ulisp.h       | H      |                           |

#+name: h2
#+begin_src python :session Python :var inp=file_list :results table :hlines no
from string import Template
import os
exec(open("./arduino.py").read())
os.system('touch ulisp.ino')#+fnames['output'])
fnames = dict_from_columns(0,1,inp)
fstatus = dict_from_columns(0,2,inp)

fstrings = {}

for i in list(fnames.keys()):fstrings[i] = read_file_to_string(fnames[i])
# for i in list(fnames.keys()):
#     try:
#         if (fstatus[i]=='T'):
#             fstrings[i] = read_file_to_string(fnames[i])
#     except:
#         print(i)

template_string = Template(fstrings['template'])
unquoted_lisp_code = fstrings['lisp_functions']
quoted_lisp_code = quote_lisp_library_text(unquoted_lisp_code)
template_string1 = template_string.safe_substitute(lisp_functions=quoted_lisp_code)
template_string2 = Template(template_string1)
template_string3 = template_string2.safe_substitute(function_definitions=fstrings['function_definitions'])
template_string4 = Template(template_string3)
template_string5 = template_string4.safe_substitute(function_enums=fstrings['function_enums'])
template_string6 = Template(template_string5)
template_string7 = template_string6.safe_substitute(function_doc=fstrings['function_doc'])

#os.system('touch ulisp.ino')#+fnames['output'])
write_string_to_file(fnames['output'],template_string7)
os.system('mv '+fnames['output']+ " " + "./ulisp/"+fnames['output'])
#+end_src

#+RESULTS: h2
| 0 |

#+RESULTS: process_files
: None


#+name: format_template
#+begin_src python :session Python :var inp=file_list :results table :hlines no


#+end_src

** Use format for template
#+name: format_template
#+begin_src python :session Python :var inp=file_list :results table :hlines no
from string import Template
import os
exec(open("./arduino.py").read())
os.system('touch ulisp.ino')#+fnames['output'])
fnames = dict_from_columns(0,1,inp)
fstatus = dict_from_columns(0,2,inp)

fstrings = {}

for i in list(fnames.keys()):fstrings[i] = read_file_to_string(fnames[i])
# for i in list(fnames.keys()):
#     try:
#         if (fstatus[i]=='T'):
#             fstrings[i] = read_file_to_string(fnames[i])
#     except:
#         print(i)
#'Lat:{latitude} Lon:{longitude}'.format(**geopoint)

#template_string = Template(fstrings['template'])
template_string = fstrings['template']
unquoted_lisp_code = fstrings['lisp_functions']
quoted_lisp_code = quote_lisp_library_text(unquoted_lisp_code)
fstrings['lisp_functions'] = quoted_lisp_code

template_string7 = template_string.format(**fstrings)
os.system('touch ulisp.ino')#+fnames['output'])
write_string_to_file(fnames['output'],template_string7)
os.system('mv '+fnames['output']+ " " + "./ulisp/"+fnames['output'])

#+end_src

#+RESULTS: format_template
| 0 |

** read file in lisp
#+begin_src lisp
(defun read-file (infile)
  (with-open-file (instream infile :direction :input :if-does-not-exist nil)
    (when instream 
      (let ((string (make-string (file-length instream))))
        (read-sequence string instream)
        string))))
ema
(setq funcs (read-file "functions.c"))
(format t "~a" funcs)

#+end_src

